      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. WRY-STORY-WRITER.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.


       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.


       END PROGRAM WRY-STORY-WRITER.
